In [18]:
import numpy as np
import pandas as pd

In [19]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [20]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [21]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [22]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [23]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [24]:
yeniVeri = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38],"Antalya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [25]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

#Thresh kaç tane nan değer oldupunda o satır veya sütün düşürülsün 
yeniDataFrame.dropna(axis=1,thresh=2)

In [26]:
#Boş değerlere 20 değerini ata
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

Groupby

In [27]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calısan Ismi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500,]
              }

In [28]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [29]:
maasDataFrame

   Departman Calısan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [30]:
groupObject = maasDataFrame.groupby("Departman")

In [31]:
groupObject.count()

           Calısan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [32]:
groupObject.mean(numeric_only=True)

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [33]:
groupObject.min()

          Calısan Ismi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazılım          Ahmet   100

In [34]:
groupObject.max()

          Calısan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [35]:
groupObject.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0